blog/2013-12-01-linkfest.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Weekend Linkfest 1.12.2013 - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Statistics and Machine Learning Awesome deep learning resource: Deep Learning Introduction to Machine Learning by Alex Smola and Geoffrey Gordon &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	<!--- MathJax Configuration -->

</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Weekend Linkfest 1.12.2013</h2>
	<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Statistics and Machine Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Awesome deep learning resource: <a href="http://deeplearning.net/#">Deep Learning</a>
</li>
<li><a href="http://alex.smola.org/teaching/cmu2013-10-701x/index.html">Introduction to Machine Learning by Alex Smola and Geoffrey Gordon</a>
</li>
<li><a href="http://markus.com/deep-learning-101/">Deep Learning 101</a>
</li>
<li><a href="http://nbviewer.ipython.org/github/twiecki/pymc3_talk/blob/master/bayesian_pymc3.ipynb">Bayesian data analysis with PyMC3</a>
</li>
<li><a href="http://blog.udacity.com/2013/11/sebastian-thrun-launching-our-data.html?m%3D1">Udacity Blog: Launching our Data Science &amp; Big Data Track built with Leading Industry Partners</a>
</li>
<li><a href="http://blog.revolutionanalytics.com/2013/11/what-data-science-can-learn-from-small-data-statistics.html">What Data Science can learn from small-data Statistics</a>
</li>
<li><a href="http://www.cs.yale.edu/homes/mmahoney/talks/mahoney-graphlab13.pdf">Randomized Regression in Parallel and Distributed Environments</a>
</li>
<li><a href="http://cm.dce.harvard.edu/2014/01/14328/publicationListing.shtml">Data Science at Harvard</a>
</li>
<li><a href="http://atpassos.me/">NIPS 2013 reading list</a>
</li>
<li><a href="http://nlp.stanford.edu/links/statnlp.html">Statistical NLP/corpus-based computational linguistics resources</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">R Package of the Week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/rstudio/ggvis">ggvis</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Paper(s) of the Week</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="http://research.microsoft.com/pubs/204048/APSIPA-Trans2013-revised-final.pdf">A nice deep learning survey paper</a>
</li>
<li><a href="http://www.cs.princeton.edu/~blei/papers/Blei2012.pdf">Survey paper on probabilistic topic models</a>
</li>
<li><a href="http://jmlr.org/papers/v11/erhan10a.html">Why Does Unsupervised Pre-training Help Deep Learning?</a>
</li>
<li><a href="http://jmlr.org/papers/v11/schaul10a.html">PyBrain</a>
</li>
<li><a href="http://www.jstatsoft.org/v55/i14/paper">Scalable Strategies for Computing with Massive Data</a>
</li>
<li><a href="http://research.google.com/pubs/pub41849.html">Bayes and Big Data: The Consensus Monte Carlo Algorithm</a>
</li>
<li><a href="http://arxiv.org/pdf/1311.2901.pdf">Visualizing and Understanding Convolutional Neural Networks</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://stanford.edu/~mwaskom/software/seaborn/">Seaborn: statistical data visualization</a>
</li>
<li><a href="http://continuum.io/blog/painless_streaming_plots_w_bokeh">Painless Streaming Plots with Bokeh</a>
</li>
<li><a href="https://vimeo.com/79842691">Bokeh Workshop</a>
</li>
<li><a href="http://c3js.org/?utm_content%3Dbuffer7270c&utm_source%3Dbuffer&utm_medium%3Dtwitter&utm_campaign%3DBuffer">C3.js - D3-based reusable chart library</a>
</li>
<li><a href="https://deveo.tv/tutorials/d3js">D3.js Intro Tutorial Video Series</a>
</li>
<li><a href="https://vimeo.com/79559271">Rapid Development and High Performance Text Processing</a>
</li>
<li><a href="http://f3.tiera.ru/other/DVD-009/Alexandrescu_A._Modern_C%2B%2B_Design%5Bc%5D_Generic_Programming_and_Design_Patterns_Applied_(2001)(en)(271s).pdf">Modern C++ Design: Generic Programming and Design Patterns Applied</a>
</li>
<li><a href="https://dataset.readthedocs.org/en/latest/">dataset: databases for lazy people</a>
</li>
<li><a href="http://yahooeng.tumblr.com/post/65453012905/introducing-samoa-an-open-source-platform-for-mining?fb_action_ids%3D10152418904187519&fb_action_types%3Dog.likes&fb_source%3Dother_multiline&action_object_map%3D%255B177747575753201%255D&action_type_map%3D%255B%2522og.likes%2522%255D&action_ref_map%3D%255B%255D&utm_content%3Dbuffer31a9d&utm_source%3Dbuffer&utm_medium%3Dtwitter&utm_campaign%3DBuffer">Introducing SAMOA, an open source platform for mining big data streams. | Yahoo Engineering</a>
</li>
<li><a href="http://tmp.devcharm.com/pages/python-modules-you-should-know">Python modules you should know</a>
</li>
<li><a href="http://www.slideshare.net/jpatanooga/metronome-ml-confnov2013v20131113">MLConf 2013: Metronome and Parallel Iterative Algorithms on YARN</a>
</li>
</ul>
</div>
</div>
</div>


<div class="meta">
	<div class="date">








  


<time datetime="2013-12-01T00:00:00+01:00" pubdate data-updated="true">Dec 1<span>st</span>, 2013</time></div>
	<div class="tags">


	<a class='category' href='/blog/categories/linkfest/'>Linkfest</a>


</div>
	
</div></article>

	<div class="share">
	<div class="addthis_toolbox addthis_default_style ">
	
	
	<a class="addthis_button_tweet"></a>
	
	
	<a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
	
	<a class="addthis_counter addthis_pill_style"></a>
	</div>
  <script type="text/javascript" src="http://s7.addthis.com/js/250/addthis_widget.js#pubid="></script>
</div>


</div>
	<footer id="footer" class="inner">Copyright &copy; 2013

    Ronert Obst

– Proud member of <a href="http://www.r-bloggers.com">www.r-bloggers.com</a>
</footer>
	<script src="/javascripts/slash.js"></script>
<script src="/javascripts/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
(function($){
	$('.fancybox').fancybox();
})(jQuery);
</script> <!-- Delete or comment this line to disable Fancybox -->


<script type="text/javascript">
      var disqus_shortname = 'everythingcounts';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



	<script type="text/javascript">
		var _gaq = _gaq || [];
		_gaq.push(['_setAccount', 'UA-40781735-1']);
		_gaq.push(['_trackPageview']);

		(function() {
			var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
			ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
			var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
		})();
	</script>



</body>
</html>